app/controllers/nodes_controller.rb

  def index
    @nodes = Node.all
---
SELECT * FROM "nodes"

  def show
    @node = Node.find(params[:id])
---
SELECT * FROM "nodes" WHERE ("nodes"."id" = 1)

  def create
    @node = Node.new(params[:node])
    @node.user = current_user
    if @node.save
---
INSERT INTO "nodes" ("created_at", "title", "ancestry", "updated_at", "user_id", "description") VALUES('2010-04-15 22:44:28', 'Sweet', '1/2', '2010-04-15 22:44:28', NULL, 'deal')
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('EBzl1eXtLonlDcXZnP_e', NULL, '2010-04-15 23:15:04', '02fddfbf960c28810e3534fe69abe59783adb1f66d5c17ed5b91a3a0458ffb62f9c91fd1721ab9bbb971b1d84346f0650a40ba5a2c7e16111e6f38c438d06b91', 'YVtTJCxK7ibAUzd_Ucc1', '2010-04-15 23:15:04', 0, NULL, 'GcWUYCU5N7FqN67mH1f_', NULL, '3d32638bc1d524bd29a1f0acbe42b7abd1c5a02c664c51dcf22ed4c02e2dc46e67396796e786704b57ccb4a770507cfccc8ec312eba82c94356980dab96acbd2', 0, NULL, 'user', NULL, 'user@xambini.com')