app/controllers/trees_controller.rb

  def index
    @trees = current_user.trees.all
---
SELECT * FROM "trees" WHERE ("trees".user_id = 1)

  def show
    @tree = Tree.find(params[:id])
---
SELECT * FROM "trees" WHERE ("trees"."id" = 1)

  def create
    @node.is_root = true

    if @node.save
---
INSERT INTO "nodes" ("created_at", "title", "ancestry", "updated_at", "description", "tree_id") VALUES('2010-04-14 23:01:25', 'test', NULL, '2010-04-14 23:01:25', NULL, 1)