app/controllers/trees_controller.rb

  def create
    @tree = current_user.trees.new(params[:tree])

    if @tree.save
---
INSERT INTO "trees" ("created_at", "updated_at", "node_id", "user_id") VALUES('2010-04-14 22:41:17', '2010-04-14 22:41:17', NULL, 1)